import { FC } from "react";
import * as S from "./Communication.styled";
import { Button, ButtonSize, ButtonVariant } from "@/components/Button";
import { useRouter } from "next/router";

const Communication: FC = () => {
  const router = useRouter();

  return (
    <S.Section>
      <div className="container">
        <S.Wrapper>
          <S.Image>
            <img
              src="images/content/communication/communication.jpg"
              alt="дівчина бариста"
            />
            <svg fill="none" viewBox="0 0 94 84">
              <path
                stroke="currentColor"
                strokeLinecap="round"
                strokeWidth="4"
                d="M60.849 5.09c-.634-1.808-3.194-1.88-4.74-2.03-5.422-.524-10.947-1.258-16.4-1.01-14.933.68-28.919 11.052-34.864 24.442-1.254 2.822-2.351 5.865-2.71 8.944-.413 3.533.16 7.342 1.237 10.715 1.415 4.43 3.845 8.679 6.44 12.527 2.555 3.79 5.8 7 9.489 9.713 7.206 5.302 15.62 9.804 24.32 12.096 3.027.797 6.241 1.465 9.385 1.51 3.28.05 6.691-.676 9.795-1.683 2.77-.898 5.399-2.207 8.043-3.41 2.964-1.35 5.961-2.722 8.67-4.541 3.976-2.67 7.023-6.477 9.385-10.585 2.55-4.436 3.468-9.603 2.971-14.678-.513-5.244-2.136-10.506-3.772-15.497-.803-2.447-1.827-4.762-3.286-6.899-2.212-3.24-5.377-6.107-8.365-8.642-1.548-1.313-3.093-2.544-4.497-4.015-1.328-1.39-2.68-2.685-4.243-3.816-4.643-3.355-10.594-2.987-16.112-2.987"
              />
              <path
                stroke="currentColor"
                strokeLinecap="round"
                strokeWidth="4"
                d="M40.544 23.032c-.578 1.676-.63 3.525-1.09 5.24a24.388 24.388 0 0 1-1.85 4.82c-.428.83-.782 1.698-1.257 2.505a1.23 1.23 0 0 0-.193.712m26.223-9.161c.706 5.042.203 10.28-.526 15.286-.278 1.902-.289 4.073-.976 5.889M60.87 62.89c-5.283-5.923-12.765-10.024-20.255-12.532-3.197-1.071-6.312-1.698-9.69-1.38-2.009.189-4.014.422-5.982.865"
              />
            </svg>
            <svg fill="none" viewBox="0 0 124 104">
              <path
                stroke="currentColor"
                strokeLinecap="round"
                strokeWidth="4"
                d="M52.112 2.976c-1.93-1.63-4.908-.059-6.776.77-6.553 2.91-13.363 5.648-19.437 9.45C9.269 23.606.18 44.346 2.305 63.3c.448 3.995 1.22 8.138 2.862 11.847 1.884 4.254 5.078 8.184 8.56 11.295 4.571 4.088 10.184 7.315 15.719 9.983 5.45 2.629 11.304 4.155 17.332 4.837 11.78 1.332 24.409.981 35.89-2.05 3.995-1.055 8.118-2.376 11.746-4.355 3.785-2.064 7.204-5.085 10.084-8.225 2.57-2.804 4.706-5.978 6.928-9.043 2.492-3.437 5.007-6.922 6.893-10.725 2.768-5.581 3.716-11.846 3.68-18.01-.039-6.653-2.435-13.078-6.386-18.486-4.083-5.589-9.45-10.48-14.649-15.058-2.55-2.244-5.264-4.196-8.358-5.665-4.69-2.229-10.223-3.423-15.333-4.354-2.646-.482-5.234-.875-7.82-1.628-2.447-.713-4.857-1.302-7.4-1.567-7.55-.79-14.112 3.468-20.426 7.031"
              />
              <path
                stroke="currentColor"
                strokeLinecap="round"
                strokeWidth="4"
                d="M40.842 36.344c.455 2.266 1.63 4.385 2.245 6.619a31.4 31.4 0 0 1 1.098 6.634c.064 1.216.237 2.423.231 3.64-.001.383.067.612.255.928m23.893-27.273c4.17 5.235 7.086 11.472 9.59 17.595.95 2.326 2.385 4.784 2.81 7.277m-40.73 23.848c9.995 3.276 21.289 3.074 31.53 1.07 4.373-.856 8.354-2.16 12.007-4.7 2.172-1.51 4.311-3.069 6.267-4.84"
              />
            </svg>
          </S.Image>
          <S.Content>
            <S.Title>Онлайн відгуки це важливо</S.Title>
            <S.Text>
              <p>
                Відвідувачі частіше обирають заклади онлайн, тому комунікація в
                інтернеті набуває дедалі важливішої ролі.
              </p>
            </S.Text>
            <S.List>
              <S.Item>Швидка комунікація</S.Item>
              <S.Item>Розвиток закладу та економія часу</S.Item>
              <S.Item>Підвищений комфорт</S.Item>
            </S.List>
            <Button
              size={ButtonSize.xxl}
              variant={ButtonVariant.Primary}
              onClick={() => router.push("/registration")}
            >
              Спробувати
            </Button>
          </S.Content>
        </S.Wrapper>
      </div>
    </S.Section>
  );
};

export default Communication;
