import { ButtonSize, ButtonVariant } from "@/components/Button";
import { Icon } from "@/shared/ui/icon";
import { Icons } from "@/shared/ui/icons";
import { FC, useState } from "react";
import * as S from "./Faq.styled";

const questions = [
  {
    title: "Налаштувати entree легко?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
  {
    title: "Моєї POS немає в списку, що робити?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
  {
    title: "Як entree допомагає заробити більше?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
  {
    title: "Чи можу я завантажити своє меню?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
  {
    title: "Ви працюєте через застосунок?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
  {
    title: "Ви надаєте лише доставку?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
  {
    title: "Чи можна перенести дані з Choice?",
    text: "(ТЕКСТ ДЛЯ ПРИКЛАДУ) Так, налаштування нашого сервісу проходить дуже легко! Усього за декілька хвилин ви вже зможете створити свій заклад. На усіх етапах ми допомагаємо)",
  },
];

const Questions: FC = () => {
  const [active, setActive] = useState<number | null>(null);

  return (
    <S.List>
      {questions.map((q, i) => (
        <S.Item key={i}>
          <S.Body $active={i === active}>
            <S.Headline>{q.title}</S.Headline>
            <S.Plus
              $active={i === active}
              onClick={() => setActive((prev) => (prev === i ? null : i))}
              size={ButtonSize.iconLg}
              variant={ButtonVariant.GrayIcon}
            >
              <Icon name={Icons.Plus} rotate={i === active ? 45 : 0} />
            </S.Plus>
            {i === active && (
              <S.Text>
                <p>{q.text}</p>
              </S.Text>
            )}
          </S.Body>
        </S.Item>
      ))}
    </S.List>
  );
};

export default Questions;
